---
kind: property
id: P:Autodesk.Revit.DB.PrintSetup.CurrentPrintSetting
source: html/64b832f9-8c68-70eb-1ade-a20a6344525e.htm
---
# Autodesk.Revit.DB.PrintSetup.CurrentPrintSetting Property

The current Print Setting of Print Setup.

## Syntax (C#)
```csharp
public IPrintSetting CurrentPrintSetting { get; set; }
```